In [ ]:
import pandas as pd
exam = pd.read_csv('exam.csv')
exam

In [ ]:
exam.query('nclass == 1') # nclass 가 1인 행만 출력

In [ ]:
exam.query('nclass == 2')

In [ ]:
exam.query('nclass != 1') # nclass 가 1이 아닌 행 출력

In [ ]:
exam.query('nclass != 3')

In [ ]:
exam.query('math > 50') # math 가 50 보다 큰 행만 출력

In [ ]:
exam.query('math < 50')

In [ ]:
exam.query('english >= 50')

In [ ]:
exam.query('english <= 80')

In [ ]:
exam.query('nclass == 1 & math >= 50') # nclass가 1과 같고 math가 50보다 크거나 같음

In [ ]:
exam.query('nclass == 2 & english >=  80')

In [ ]:
exam.query('math >= 90 | english >= 90') # math가 90보다 크거나 english가 90보다 큼

In [ ]:
exam.query('english < 90 | science < 50')

In [ ]:
exam.query('nclass == 1 | nclass == 3 | nclass == 5') # 1, 3, 5 중 하나라도 참이면 출력

In [ ]:
exam.query('nclass in [1, 3, 5]') # 목록에 해당하는 행 추출

In [ ]:
nclass1 = exam.query('nclass == 1') # 추출한 행으로 데이터 생성
nclass2 = exam.query('nclass == 2')

nclass1 # 데이터 출력
nclass2

In [ ]:
nclass1['math'].mean() # 1반의 수학 점수 평균

In [ ]:
nclass2['math'].mean()

In [ ]:
df = pd.DataFrame(
    {'sex' : ['F', 'M', 'F', 'M'],
     'country' : ['Korea', 'China', 'Japan', 'USA']
    }
)
df # 문자 변수를 이용해 '전체 조건'과 '추출할 문자'에 해당하는 값 추출

In [ ]:
df.query('sex == "F" & country == "Korea"') ## 전체 조건과 추출한 문자의 따옴표는 달라야 함
df.query("sex == 'M' & country == 'China'")

# df.query('sex == 'F'' & country == 'Korea'') 같으면 에러남

In [ ]:
var = 3
exam.query('nclass == @var') # 외부 변수를 이용해 조건에 맞는 행 추출

In [ ]:
pd.set_option('display.max_rows', None) # 모든 행 출력하도록 설정
pd.set_option('display.max_columns',None) # 모든 열 출력 "

pd.reset_option('display.max_rows') # 설정 리셋
pd.reset_option('display.max_columns')

pd.reset_option('all') #모든 설정 리셋

In [ ]:
mpg = pd.read_csv('mpg.csv') # 6장 첫 번째 문제
mpg

In [ ]:
mpg_displ1 = mpg.query('displ <= 4') # Q1
mpg_displ1['hwy'].mean()

In [ ]:
mpg_displ2 = mpg.query('displ >= 5')
mpg_displ2['hwy'].mean()

In [ ]:
mpg_audi = mpg.query("manufacturer == 'audi'") # Q2
mpg_audi['cty'].mean()

In [ ]:
mpg_toyota = mpg.query("manufacturer == 'toyota'")
mpg_toyota['cty'].mean()

In [ ]:
mpg_manu = mpg.query("manufacturer in ['chevrolet', 'ford', 'honda']") # Q3
mpg_manu['hwy'].mean()

In [ ]:
exam['math'] # 필요한 행만 추출

In [105]:
exam[['nclass', 'math', 'english']] # 여러 변수 추출

    nclass  math  english
0        1    50       98
1        1    60       97
2        1    45       86
3        1    30       98
4        2    25       80
5        2    50       89
6        2    80       90
7        2    90       78
8        3    20       98
9        3    50       98
10       3    65       65
11       3    45       85
12       4    46       98
13       4    48       87
14       4    75       56
15       4    58       98
16       5    65       68
17       5    80       78
18       5    89       68
19       5    78       83

In [ ]:
exam['math'] # 값만 출력 (시리즈)
exam[['math']] # 대괄호를 두번 쓰면 행이름 유지 (데이터 프레임)

In [ ]:
exam.drop(columns='math') # 변수 제거
exam_d = exam.drop(columns='math') # 제거된 프레임을 변수로 지정해야 완전히 삭제됨

In [ ]:
exam.drop(columns = ['math', 'english'])

In [ ]:
exam.query('nclass == 1')['english'] # nclass가 1인 행만 추출 후 english 추출

In [ ]:
exam.query('math >= 50')[['id', 'math']] # math가 50 이상인 id, math 추출

In [ ]:
exam.query('math >= 50')[['id', 'math']].head() # 앞부분 5열만 출력

In [ ]:
exam.query('math >= 50')[['id', 'math']].head(10) # 앞부분 10열만 출력

In [ ]:
## 명령어 뒤에 '\' 입력 후 엔터로 줄바꿈 - 가독성 증가

In [107]:
mpg[['category', 'cty']] # 두 번째 혼자서 해보기 Q1

    category  cty
0    compact   18
1    compact   21
2    compact   20
3    compact   21
4    compact   16
..       ...  ...
229  midsize   19
230  midsize   21
231  midsize   16
232  midsize   18
233  midsize   17

[234 rows x 2 columns]

In [112]:
mpg_cc = mpg[['category', 'cty']] # Q2

mpg_cc.query("category == 'suv'").mean() # 13.5
mpg_cc.query("category == 'compact'").mean() # 20.1

C:\Users\User\AppData\Local\Temp\ipykernel_4596\3798720301.py:3: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  mpg_cc.query("category == 'suv'").mean() # 13.5
C:\Users\User\AppData\Local\Temp\ipykernel_4596\3798720301.py:4: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  mpg_cc.query("category == 'compact'").mean() # 20

cty    20.12766
dtype: float64